snlkuharlocal/src/Documents/ЗаправкаГСМ/ЗаправкаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаправкаГСМ</name>
  <basedOn>Document.ПутевойЛист</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиГСМ</registerRecords>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>кДокументу</name>
    <type>
      <types>DocumentRef.ПутевойЛист</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Documents/ПутевойЛист/ПутевойЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевойЛист</name>
  <basedOn>Document.ПутевойЛист</basedOn>
  <registerRecords>InformationRegister.ПоказанияСпидометра</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиГСМ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйСпидометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТопливаВозврат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Диспетчер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикПредставитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик1Представитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыездИзГаража</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращениеВГараж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп1</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПутевого</name>
    <type>
      <types>EnumRef.ТипПутевогоЛиста</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик1</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик2</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик3</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик4</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия3</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия4</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробегЗаПутевку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТопливаВыезд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйСпидометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправкаНаМаршруте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпидометрСкорректированВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыездИзГаражаФактический</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращениеВГаражФактическое</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньВыездаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньВозвращениеФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВтораяХодка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданиеВодителю</name>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаПогрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаРазгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Груз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕздок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПеревезтиТонн</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаданиеВодителюАвтобусНеОбщегоПользования</name>
    <attributes>
      <name>Откуда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Куда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаправкаГСМ/Forms/ФормаДокумента/Module.bsl
&НаСервере
Перем ЕстьИзмененияПоБензину;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 //Объект.Дата=ТекущаяДата();
ПриОткрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере ()
	 если Объект.Дата<=Объект.кДокументу.дата тогда
		Объект.Дата=Объект.кДокументу.дата-1;
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТекОстаток1=ПоказанияНачальныхОстатков(Объект.Автомобиль, НачалоДня(Объект.Дата));
	ТекОстаток2=ПоказанияНачальныхОстатков(Объект.Автомобиль, КонецДня(Объект.Дата));

	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	ПутевойЛист.Ссылка КАК Ссылка,
	              |	ПутевойЛист.Дата КАК Дата
	              |ИЗ
	              |	Документ.ПутевойЛист КАК ПутевойЛист
	              |ГДЕ
	              |	ПутевойЛист.Дата >= &Дата
	              |	И ПутевойЛист.Автомобиль = &Автомобиль
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Дата";

	запрос.УстановитьПараметр("Дата",НачалоДня(объект.Дата));	
	запрос.УстановитьПараметр("Автомобиль",Объект.Автомобиль);
	результат=запрос.Выполнить().Выбрать();
	ПараметрыСеанса.Ошибки="";
	пока результат.Следующий() цикл
		Путевка=результат.ссылка.получитьобъект();
		если ложь тогда Путевка =Документы.ПутевойЛист.СоздатьДокумент();КонецЕсли;
		РежимЗаписи=?(Путевка.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись);
		СтарыйОстатокТопливаВыезд= Путевка.ОстатокТопливаВыезд;
		СтарыйОстатокТопливаВозврат=Путевка.ОстатокТопливаВозврат;
		
		
		Путевка.ЗаправкаНаМаршруте=ПолучитьЗаправку(результат.ссылка);
		Путевка.ОстатокТопливаВыезд=ПоказанияНачальныхОстатков(Путевка.Автомобиль, НачалоДня(Путевка.Дата));
		Путевка.ОстатокТопливаВозврат=Путевка.ОстатокТопливаВыезд+Путевка.ЗаправкаНаМаршруте-Путевка.Расход;


		если СтарыйОстатокТопливаВозврат<>Путевка.ОстатокТопливаВозврат или СтарыйОстатокТопливаВозврат<>Путевка.ОстатокТопливаВыезд тогда
			Путевка.Записать(РежимЗаписи);
			
			ПараметрыСеанса.Ошибки=ПараметрыСеанса.Ошибки+"Перерасчитаны данные "+Путевка+" выезд с " +СтарыйОстатокТопливаВыезд+" на "+Путевка.ОстатокТопливаВыезд +". возврат с "
			+СтарыйОстатокТопливаВозврат+" на "+Путевка.ОстатокТопливаВозврат+Символы.ПС;	
		КонецЕсли;

	КонецЦикла;
	
	
	
КонецПроцедуры



// Кухарь  18.05.2022 начало
//


Функция ПолучитьЗаправку(Путевка)
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	ЗаправкаГСМ.Ссылка КАК Ссылка,
	              |	ЗаправкаГСМ.Количество КАК Количество
	              |ИЗ
	              |	Документ.ЗаправкаГСМ КАК ЗаправкаГСМ
	              |ГДЕ
	              |	ЗаправкаГСМ.Проведен
	              |	И ЗаправкаГСМ.кДокументу = &Путевка";
	запрос.УстановитьПараметр("Путевка",Путевка);
	результат=запрос.Выполнить().выбрать();

	
	пока результат.Следующий() цикл
		возврат результат.Количество;
	КонецЦикла;
	
	возврат 0;
	
КонецФункции
	
	
	
Функция ЕстьИзмененияПоБензину()
	ЕстьИзменения=ложь;

	если Объект.Количество<>Объект.Ссылка.Количество или Объект.Автомобиль<>Объект.ссылка.Автомобиль или НачалоДня(объект.Дата)<>НачалоДня(Объект.ссылка.Дата)  тогда
		ЕстьИзменения=Истина;
	КонецЕсли;	
	
	Возврат ЕстьИзменения;
	
КонецФункции


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекОстаток1=ПоказанияНачальныхОстатков(Объект.Автомобиль, НачалоДня(Объект.Дата));
	ТекОстаток2=ПоказанияНачальныхОстатков(Объект.Автомобиль, КонецДня(Объект.Дата));
	
	
	Если ЕстьИзмененияПоБензину() тогда
		ЕстьИзмененияПоБензину=Истина
		//Объект.ОстатокТопливаВыезд = МодульПутевогоЛиста.ПоказанияНачальныхОстатков(Объект.Автомобиль, Объект.Дата);
	иначе
		ЕстьИзмененияПоБензину=Ложь;
	КонецЕсли;
	
	

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Сообщение=ПолучитьОшибки();
	//Предупреждение(Сообщение);
	
КонецПроцедуры



&НаСервере
Функция ПолучитьОшибки()
	//Текст=ПараметрыСеанса.Ошибки;
	//ПараметрыСеанса.Ошибки="";
	возврат "";
КонецФункции
//Кухарь  18.05.2022 конец

&НаСервереБезКонтекста
Функция ПоказанияНачальныхОстатков(Автомобиль,Дата)
	Возврат Документы.ПутевойЛист.ПоказанияНачальныхОстатков(Автомобиль,Дата);
КонецФункции // ()
